--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY AHMED ALOBAIDY                   ▀▄ ▄▀ 
▀▄ ▄▀     BY SAJAD ALOBAIDY (@A7mEd_B98)    ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY AHMED ALOBAIDY          ▀▄ ▄▀   
▀▄ ▄▀          help2  : مساعدة2            ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function run(msg, matches)
local reply_id = msg['id']
local S = [[ 
تابع قناة البوت @dev_ahmed_98

✔️تعمل جميع الاوامر بدون وضع / او !
ا🔸➖🔹➖🔸➖🔹➖🔸
 🤖 صوت : الكلمة المراد نطقها
        صوت  AHMED [يدعم الانلكش فقط]

 🤖 صوره : الكلمه المراد تحويلها صوره
        صوره  AHMED [يدعم الانلكش فقط]
 
 🤖 الدعم : الكلمة المراد ارسالهه لمجموعة دعم البوت
        الدعم هلو 

 🤖 خريطه : لجلب الخرائط
        خريطه العراق

 🤖 انستا : اليوزر لمعرفه معلومات الانستا

 🤖 ملصق : قم بارسال صورة
        وقم بلرد عليها بكلمة لجعله ملصق

 🤖 صوره : قم بارسال ملصق
        وقم بالرد  عليه لجعلها صورة
ا🔸➖🔹➖🔸➖🔹➖🔸
🃏🔺للأستفسار:- راسل المطور :- ☢⚜ 
✋🏿👇🏿
#Dev : @A7mEd_B98
#Dev_Channel : @dev_ahmed_98
 ]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(مساعدة 2)$",
},
run = run 
}
end
