--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY AHMED ALOBAIDY                   ▀▄ ▄▀ 
▀▄ ▄▀     BY Ahmed Alobaidy (@A7mEd_B98)    ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY Ahmed Alobaidy       ▀▄ ▄▀   
▀▄ ▄▀          help1  : مساعدة             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'مساعدة 1' then
local S = [[  🤖 صعد اداري >/: صعد ادمن في المجموعة
🤖 نزل ادري >/ : حذف ادمن في المجوعة
🤖 صعد ادمن >/ : صعد ادمن
🤖 نزل ادمن >/ : حذف ادمن
🤖 الادمنية >/: لاظهار ادمنية المجموعة
🤖 الادارين >/: اضهار اداريين المجموعة
  ـ ➖➖➖⚠️✅➖➖
✔️  قائمة الحظر… 😉والطرد.🏃🚪
🤖 طرد : لطرد العضو
🤖 حظر : لحظر العظر
🤖 الغاء الحظر : افتح الخظر عن العضو
🤖 مغادرة : للخروج من المجموعة
🤖 نلصم  : لتفعيل الصمت على احد الاعضاء
🤖 نلصم  : الغاء الصمت على العضو
🤖 منع كلمة  : لطرد الكلمة ب مجموعه
🤖 الغاء المنع : لافتح طرد الكلمة
🤖 قائمة  المنع : لعرض الكلمات المحظورة
  ـ ➖➖➖🔴☑️➖➖
✔️  الاوامر الايدي والمعلومات. ✅🔰
🤖 ايدي : لاظهار ايدي المجموعة
🤖 ايدي : لاظهار ايدي الشخص بلرد
🤖 معلوماتي : اضهار المعلومات الخاصه بك
🤖 معلومات المجموعة : اضهار معلومات بالمجموعة
🤖 الاعدادات : اضهار اعدادات المجموعة
🤖 اعدادات الوسائط : اضهار اعادادات الوسائط
  ـ ➖➖🔶➖➖🔷➖
✔️  اوامر تحكم المجموعة .🛡💢
🤖 القوانين : لاضهار القوانين
🤖 ضع القوانين : لاظافة القوانين
🤖 ضع وصف : لاظافه وصف حول
🤖 ضع الصورة : لوضع صورة
🤖 ضع الاسم : لوضع الاسم
🤖 ضع المعرف >/: لوضع المعرف للكروب
🤖 تغير الرابط : لصنع الرابط او تغيرة
🤖 الرابط : لضهور الرابط ب المجموعة
🤖 الرابط خاص : للحصول على الرابط في الخاص
  ـ🔸➖🔹➖🔸➖🔹➖
✔️  آوامر امان المجموعة...🛡💢 
🤖 اقفل الاضافه  : لمنع الاضافه ب المجموعة
🤖 اقفل الاضافه  : لسماح الاضافه ب ===
🤖 اقفل الدردشه : لمنع الدردشه للمجموعه
🤖 افتح الدردشه  : للسماح للدردشه للمجموعه
🤖 اقفل الصور : لمنع إرسال الصور 
🤖 افتح الصور  : للسماح بإرسال الصور 
🤖 اقفل الصوت  : لمنع البصمات 
🤖 افتح الصوت   : للسماح بإرسال البصمات 
🤖 اقفل الفيديو  : لمنع ارسال فديو 
🤖 افتح الفيديو   : للسماح بإرسال فديو 
🤖 اقفل الروابط   : لمنع الروابط 
🤖 افتح الروابط  : للسماح بإرسال روابط
🤖 اقفل التكرار  : لمنع التكرار 
🤖 افتح التكرار   : للسماح بلتكرار 
🤖 اقفل الملصقات : لمنع الملصقات 
🤖 افتح الملصقات : للسماح بلملصقات
🤖 اقفل الصور المتحركه : لمنع الصور المتحركة
🤖 افتح الصور المتحركه  : للسماح بالصور المتحركة
🤖 اقفل الفايلات  : لمنع ارسال الملفات 
🤖 افتح الفايلات   : للسماح بإرسال الملفات 
🤖 اقفل الكلايش : لمنع الكلايش الطويلة
🤖 افتح الكلايش : للسماح بلكلايش الطويلة
🤖 اقفل الجماعيه : منع  الاعضاء بالاضافه
🤖 افتح الجماعيه : سماح الاعضاء بالاضافه
🤖 اقفل العربيه  : لمنع اللغة ألعربيه 
🤖 افتح العربيه  : للسماح بلغه ألعربيه
🤖 اقفل اعاده توجيه : منع اعادة توجيه 
🤖 افتح اعاده توجيه : سماح باعادة توجيه
  ـ🔸➖🔹➖🔸➖🔹➖
🃏🔺 dev  ارسل لمعرفة مصنع البوت

#Dev : @A7mEd_B98
#Dev_Chanale_bot==>dev_ahmed_98
]]
reply_msg(reply_id, S, ok_cb, false)
end

if not is_momod(msg) then
local S = "للمشرفين فقط 😎🖕🏿"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(مساعدة 1)$",
},
run = run 
}
end
